\set ECHO none
ERROR:  function set_sphere_output_precision(integer) does not exist
LINE 1: SELECT set_sphere_output_precision(8);
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
--
-- ellipse and path
--
  
-- negators , commutator @,&&
SELECT spath '{(280d, -9d),(280d, -8d)}'   @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d, -8d)}'   @  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d,-12d)}'   @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d,-12d)}'   @  sellipse '<{10...
               ^
SELECT spath '{(280d,-11d),(280d,-12d)}'   @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d,-11d),(280d,-12d)}'   @  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d, -8d)}'  &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d, -8d)}'  &&  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d,-12d)}'  &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d,-12d)}'  &&  sellipse '<{10...
               ^
SELECT spath '{(280d,-11d),(280d,-12d)}'  &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d,-11d),(280d,-12d)}'  &&  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d, -8d)}'  !@  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d, -8d)}'  !@  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d,-12d)}'  !@  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d,-12d)}'  !@  sellipse '<{10...
               ^
SELECT spath '{(280d,-11d),(280d,-12d)}'  !@  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d,-11d),(280d,-12d)}'  !@  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d, -8d)}' !&&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d, -8d)}' !&&  sellipse '<{10...
               ^
SELECT spath '{(280d, -9d),(280d,-12d)}' !&&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -9d),(280d,-12d)}' !&&  sellipse '<{10...
               ^
SELECT spath '{(280d,-11d),(280d,-12d)}' !&&  sellipse '<{10d,5d},(280d,-20d),90d>'; 
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d,-11d),(280d,-12d)}' !&&  sellipse '<{10...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spath '{(280d, -9d),(280d, -8d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spath '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spath '{(280d, -9d),(280d,-12d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spath '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spath '{(280d,-11d),(280d,-12d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spath '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spath '{(280d, -9d),(280d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spath '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spath '{(280d, -9d),(280d,-12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spath '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spath '{(280d,-11d),(280d,-12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spath '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spath '{(280d, -9d),(280d, -8d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spath '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spath '{(280d, -9d),(280d,-12d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spath '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spath '{(280d,-11d),(280d,-12d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spath '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spath '{(280d, -9d),(280d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spath '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spath '{(280d, -9d),(280d,-12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spath '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spath '{(280d,-11d),(280d,-12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spath '{(...
               ^
-- path is a line , ellipse is point
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{0d,0d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{0d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{0d,0d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{0d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{0d,0d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{0d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{0d,0d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{0d...
               ^
-- path is a line , ellipse is circle
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d,5d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d,5d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d...
               ^
-- path is a line , ellipse is path
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d,0d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d,0d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{5d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d,0d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d,0d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{5d...
               ^
-- path is a line , ellipse is a real ellipse
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{10...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{10d,5d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'   @  sellipse '<{10...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{10...
               ^
SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{10d,5d},(280d, -8d),90d>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(280d, -8d),(280d, -9d)}'  &&  sellipse '<{10...
               ^
-- create path as aggregate
SELECT spath(data.p) FROM ( SELECT spoint '(0,1)' as p UNION ALL SELECT spoint '(1,1)' UNION ALL SELECT '(1,0)' ) AS data ;
ERROR:  type "spoint" does not exist
LINE 1: SELECT spath(data.p) FROM ( SELECT spoint '(0,1)' as p UNION...
                                           ^
--
-- checking path other operators
--
  
\set poly  'spoly \'{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1),(0.4,-0.1),(0.5,0.1),(0.4,0.2),(0.1,0.2)}\''
\set path1 'spath \'{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1),(0.4,-0.1),(0.5,0.1),(0.4,0.2),(0.1,0.2)}\''
\set path2 'spath \'{(0,0),(1,0),(2,0),(3,0)}\''
\set path3 'spath \'{(0,0),(0,1),(0,1.5)}\''
SELECT @-@ spath '{(0,0),(1,0),(2,0),(3,0)}';
ERROR:  type "spath" does not exist
LINE 1: SELECT @-@ spath '{(0,0),(1,0),(2,0),(3,0)}';
                   ^
SELECT :path1 =  :path2;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path1 =  :path1;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path1 <> :path2;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path1 <> :path1;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :poly  && :path1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path1 && :poly ;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path1 @  :poly ;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path2 @  :poly ;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(1,0),(2,0),(3,0)}' @  spoly '{(0.1,0),...
               ^
SELECT :path1 && :path1;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path1 && :path1;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :poly  && :path2;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path2 && :poly ;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(1,0),(2,0),(3,0)}' && spoly '{(0.1,0),...
               ^
SELECT :path2 && :path1;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(1,0),(2,0),(3,0)}' && spath '{(0.1,0),...
               ^
SELECT :poly  && :path3;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path3 && :poly ;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && spoly '{(0.1,0),(0.2...
               ^
SELECT :path3 && :path1;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && spath '{(0.1,0),(0.2...
               ^
SELECT :path3 && :path2;
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && spath '{(0,0),(1,0),...
               ^
SELECT :path1 @  scircle '<(0,1),1>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path3 @  scircle '<(0,1),1>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' @  scircle '<(0,1),1>';
               ^
SELECT :path3 @  scircle '<(0,1),0.7>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' @  scircle '<(0,1),0.7>...
               ^
SELECT :path1 && scircle '<(0,1),1>';  
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1...
               ^
SELECT :path3 && scircle '<(0,1),1>';  
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && scircle '<(0,1),1>';
               ^
SELECT :path3 && scircle '<(0,1),0.7>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && scircle '<(0,1),0.7>...
               ^
SELECT :path3 && scircle '<(0,-1),0.7>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && scircle '<(0,-1),0.7...
               ^
SELECT :path3 @  scircle '<(0,-1),0.7>';
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' @  scircle '<(0,-1),0.7...
               ^
SELECT :path3 && sline ( spoint '(0,-1)', spoint '(0,1)' );
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && sline ( spoint '(0,-...
               ^
SELECT :path3 && sline ( spoint '(-1,0)', spoint '(1,0)' );
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && sline ( spoint '(-1,...
               ^
SELECT :path3 && sline ( spoint '(-1,0)', spoint '(-0.3,0)' );
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0,0),(0,1),(0,1.5)}' && sline ( spoint '(-1,...
               ^
SELECT spath '{(0.11,0.15),(0.12,0.15),(0.13,0.15)}' @ :poly; 
ERROR:  type "spath" does not exist
LINE 1: SELECT spath '{(0.11,0.15),(0.12,0.15),(0.13,0.15)}' @ spoly...
               ^
-- create path
SELECT spath(data.p) FROM ( SELECT spoint '(0,1)' as p UNION ALL SELECT spoint '(1,1)' UNION ALL SELECT '(1,0)' ) AS data ;
ERROR:  type "spoint" does not exist
LINE 1: SELECT spath(data.p) FROM ( SELECT spoint '(0,1)' as p UNION...
                                           ^
SELECT set_sphere_output( 'DEG' );
ERROR:  function set_sphere_output(unknown) does not exist
LINE 1: SELECT set_sphere_output( 'DEG' );
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- test stored data
SELECT spoint(p,2) FROM spheretmp6 WHERE id=2;
ERROR:  relation "spheretmp6" does not exist
LINE 1: SELECT spoint(p,2) FROM spheretmp6 WHERE id=2;
                                ^
