\set ECHO none
ERROR:  function set_sphere_output_precision(integer) does not exist
LINE 1: SELECT set_sphere_output_precision(8);
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- checking polygon operators
\set poly 'spoly \'{(0.1,0),(0.2,0),(0.2,0.1),(0.3,0.1),(0.3,-0.1),(0.4,-0.1),(0.5,0.1),(0.4,0.2),(0.1,0.2)}\''
SELECT spoint   '(0.15,0.10)' @ :poly;                  -- point inside polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT spoint   '(0.15,0.10)' @ spoly '{(0.1,0),(0.2,0),(0.2...
               ^
SELECT spoint   '(0.20,0.00)' @ :poly;                  -- point contained polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT spoint   '(0.20,0.00)' @ spoly '{(0.1,0),(0.2,0),(0.2...
               ^
SELECT spoint   '(0.10,0.10)' @ :poly;                  -- point contained polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT spoint   '(0.10,0.10)' @ spoly '{(0.1,0),(0.2,0),(0.2...
               ^
SELECT spoint   '(0.25,0.50)' @ :poly;                  -- point outside polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT spoint   '(0.25,0.50)' @ spoly '{(0.1,0),(0.2,0),(0.2...
               ^
SELECT spoint   '(0.25,0.00)' @ :poly;                  -- point outside polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT spoint   '(0.25,0.00)' @ spoly '{(0.1,0),(0.2,0),(0.2...
               ^
SELECT scircle  '<(0.15,0.10),0.03>' @  :poly;          -- circle inside polygon
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.15,0.10),0.03>' @  spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.20,0.00),0.00>' @  :poly;          -- circle contained polygon 
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.20,0.00),0.00>' @  spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.20,0.30),0.05>' @  :poly;          -- circle outside  polygon 
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.20,0.30),0.05>' @  spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.25,0.00),0.05>' @  :poly;          -- circle overlaps polygon
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.25,0.00),0.05>' @  spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.25,0.00),0.10>' @  :poly;          -- circle overlaps polygon
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.25,0.00),0.10>' @  spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.15,0.10),0.03>' && :poly;          -- circle inside polygon
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.15,0.10),0.03>' && spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.20,0.00),0.00>' && :poly;          -- circle contained polygon 
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.20,0.00),0.00>' && spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.20,0.30),0.05>' && :poly;          -- circle outside  polygon 
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.20,0.30),0.05>' && spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.25,0.00),0.05>' && :poly;          -- circle overlaps polygon
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.25,0.00),0.05>' && spoly '{(0.1,0),(0.2...
               ^
SELECT scircle  '<(0.25,0.00),0.10>' && :poly;          -- circle overlaps polygon
ERROR:  type "scircle" does not exist
LINE 1: SELECT scircle  '<(0.25,0.00),0.10>' && spoly '{(0.1,0),(0.2...
               ^
SELECT sline ( spoint '(0.00, 0.00)', spoint '(0.10,0.20)' ) @  :poly;  -- line touches polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.00, 0.00)', spoint '(0.10,0.20)' )...
                       ^
SELECT sline ( spoint '(0.00, 0.10)', spoint '(0.10,0.10)' ) @  :poly;  -- line touches polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.00, 0.10)', spoint '(0.10,0.10)' )...
                       ^
SELECT sline ( spoint '(0.50, 0.00)', spoint '(0.50,0.20)' ) @  :poly;  -- line touches polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.50, 0.00)', spoint '(0.50,0.20)' )...
                       ^
SELECT sline ( spoint '(0.10, 0.20)', spoint '(0.20,0.00)' ) @  :poly;  -- line touches and inside polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.10, 0.20)', spoint '(0.20,0.00)' )...
                       ^
SELECT sline ( spoint '(0.45,-0.20)', spoint '(0.45,0.20)' ) @  :poly;  -- line overlaps polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.45,-0.20)', spoint '(0.45,0.20)' )...
                       ^
SELECT sline ( spoint '(0.45, 0.10)', spoint '(0.45,0.20)' ) @  :poly;  -- line overlaps polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.45, 0.10)', spoint '(0.45,0.20)' )...
                       ^
SELECT sline ( spoint '(0.24, 0.17)', spoint '(0.25,0.14)' ) @  :poly;  -- line inside  polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.24, 0.17)', spoint '(0.25,0.14)' )...
                       ^
SELECT sline ( spoint '(0.00, 0.00)', spoint '(0.10,0.20)' ) && :poly;  -- line touches polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.00, 0.00)', spoint '(0.10,0.20)' )...
                       ^
SELECT sline ( spoint '(0.00, 0.10)', spoint '(0.10,0.10)' ) && :poly;  -- line touches polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.00, 0.10)', spoint '(0.10,0.10)' )...
                       ^
SELECT sline ( spoint '(0.50, 0.00)', spoint '(0.50,0.20)' ) && :poly;  -- line touches polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.50, 0.00)', spoint '(0.50,0.20)' )...
                       ^
SELECT sline ( spoint '(0.10, 0.20)', spoint '(0.20,0.00)' ) && :poly;  -- line touches and inside polygon 
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.10, 0.20)', spoint '(0.20,0.00)' )...
                       ^
SELECT sline ( spoint '(0.45,-0.20)', spoint '(0.45,0.20)' ) && :poly;  -- line overlaps polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.45,-0.20)', spoint '(0.45,0.20)' )...
                       ^
SELECT sline ( spoint '(0.45, 0.10)', spoint '(0.45,0.20)' ) && :poly;  -- line overlaps polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.45, 0.10)', spoint '(0.45,0.20)' )...
                       ^
SELECT sline ( spoint '(0.24, 0.17)', spoint '(0.25,0.14)' ) && :poly;  -- line inside  polygon
ERROR:  type "spoint" does not exist
LINE 1: SELECT sline ( spoint '(0.24, 0.17)', spoint '(0.25,0.14)' )...
                       ^
\unset poly
\set poly1 'spoly \'{(0,0),(1,0),(0,1)}\''
\set poly2 'spoly \'{(1,0),(0,0),(0,1)}\''
\set poly3 'spoly \'{(0,1),(0,0),(1,0)}\''
\set poly4 'spoly \'{(0.1,0.9),(0.1,0.1),(0.9,0.1)}\''
\set poly5 'spoly \'{(0.2,0.0),(1.2,0.0),(0.2,1)}\''
SELECT :poly1  = :poly2;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}'  = spoly '{(1,0),(0,0),(0...
               ^
SELECT :poly2  = :poly3;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1,0),(0,0),(0,1)}'  = spoly '{(0,1),(0,0),(1...
               ^
SELECT :poly3  = :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,1),(0,0),(1,0)}'  = spoly '{(0,0),(1,0),(0...
               ^
SELECT :poly1 && :poly2;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}' && spoly '{(1,0),(0,0),(0...
               ^
SELECT :poly2 && :poly3;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1,0),(0,0),(0,1)}' && spoly '{(0,1),(0,0),(1...
               ^
SELECT :poly3 && :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,1),(0,0),(1,0)}' && spoly '{(0,0),(1,0),(0...
               ^
SELECT :poly1  @ :poly2;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}'  @ spoly '{(1,0),(0,0),(0...
               ^
SELECT :poly2  @ :poly3;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1,0),(0,0),(0,1)}'  @ spoly '{(0,1),(0,0),(1...
               ^
SELECT :poly3  @ :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,1),(0,0),(1,0)}'  @ spoly '{(0,0),(1,0),(0...
               ^
SELECT :poly1  @ :poly4;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}'  @ spoly '{(0.1,0.9),(0.1...
               ^
SELECT :poly4  @ :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.1,0.9),(0.1,0.1),(0.9,0.1)}'  @ spoly '{(0...
               ^
SELECT :poly1 && :poly4;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}' && spoly '{(0.1,0.9),(0.1...
               ^
SELECT :poly4 && :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.1,0.9),(0.1,0.1),(0.9,0.1)}' && spoly '{(0...
               ^
SELECT :poly1  @ :poly5;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}'  @ spoly '{(0.2,0.0),(1.2...
               ^
SELECT :poly5  @ :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.2,0.0),(1.2,0.0),(0.2,1)}'  @ spoly '{(0,0...
               ^
SELECT :poly1 && :poly5;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0,0),(1,0),(0,1)}' && spoly '{(0.2,0.0),(1.2...
               ^
SELECT :poly5 && :poly1;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.2,0.0),(1.2,0.0),(0.2,1)}' && spoly '{(0,0...
               ^
\unset poly1
\unset poly2
\unset poly3
\unset poly4
\unset poly5
-- From testsuite/poly_test.sql
SELECT set_sphere_output('DEG');
ERROR:  function set_sphere_output(unknown) does not exist
LINE 1: SELECT set_sphere_output('DEG');
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
SELECT spoly '{(10d,0d),(10d,1d),(15d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(10d,0d),(10d,1d),(15d,0d)}';
               ^
SELECT spoly '{(359d,0d),(359d,1d),(4d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(359d,0d),(359d,1d),(4d,0d)}';
               ^
SELECT spoly '{(10d,0d),(10d,1d),(15d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(10d,0d),(10d,1d),(15d,0d)}';
               ^
-- incorrect input -----
SELECT spoly '{(10d,0d),(10d,1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(10d,0d),(10d,1d)}';
               ^
--- self-crossing input -----
SELECT spoly '{(0d,0d),(10d,10d),(0d,10d),(10d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(10d,10d),(0d,10d),(10d,0d)}';
               ^
--- functions
SELECT npoints( spoly '{(10d,0d),(10d,1d),(15d,0d)}');
ERROR:  type "spoly" does not exist
LINE 1: SELECT npoints( spoly '{(10d,0d),(10d,1d),(15d,0d)}');
                        ^
SELECT npoints( spoly '{(10d,0d),(10d,1d),(15d,0d),(5d,-5d)}');
ERROR:  type "spoly" does not exist
LINE 1: SELECT npoints( spoly '{(10d,0d),(10d,1d),(15d,0d),(5d,-5d)}...
                        ^
--SELECT npoints( spoly '{(0d,0d),(0d,90d),(15d,90d),(15d,0d)}');
SELECT area(spoly '{(0d,0d),(0d,90d),(1,0d)}');
ERROR:  type "spoly" does not exist
LINE 1: SELECT area(spoly '{(0d,0d),(0d,90d),(1,0d)}');
                    ^
SELECT area(spoly '{(0d,0d),(0d,90d),(90d,0d)}')/(4.0*pi());
ERROR:  type "spoly" does not exist
LINE 1: SELECT area(spoly '{(0d,0d),(0d,90d),(90d,0d)}')/(4.0*pi());
                    ^
--- operations
--- = operator
--- should be true
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' = spoly '{(1d,1d),(2d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' = spoly '{(1d,1d),(...
               ^
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' = spoly '{(2d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' = spoly '{(2d,1d),(...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' = spoly '{(1d,0d),(0d,0d),(0d,1d),(1d,1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' = spoly '{(...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' = spoly '{(0d,0d),(1d,0d),(1d,1d),(0d,1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' = spoly '{(...
               ^
--- should be false
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' = spoly '{(1d,1d),(3d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' = spoly '{(1d,1d),(...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' = spoly '{(1d,0d),(0d,0d),(0d,1d),(2d,2d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' = spoly '{(...
               ^
--- <> operator
--- should be false
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(1d,1d),(2d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(1d,1d),...
               ^
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(2d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(2d,1d),...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{(1d,0d),(0d,0d),(0d,1d),(1d,1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{(0d,0d),(1d,0d),(1d,1d),(0d,1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{...
               ^
--- should be true
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(1d,1d),(3d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(1d,1d),...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{(1d,0d),(0d,0d),(0d,1d),(2d,2d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{...
               ^
--- spoint @ spoly
--- should be true
SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(1d,1d),(3d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(1d,0d),(1d,1d),(2d,1d)}' <> spoly '{(1d,1d),...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{(1d,0d),(0d,0d),(0d,1d),(2d,2d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' <> spoly '{...
               ^
--- spoint @ spoly
--- should be true
SELECT '(0.5d,0.5d)'::spoint @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0.5d,0.5d)'::spoint @ spoly '{(0d,0d),(0d,1d),(1d,1...
                              ^
SELECT '(0d,0.5d)'::spoint @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,0.5d)'::spoint @ spoly '{(0d,0d),(0d,1d),(1d,1d)...
                            ^
SELECT '(0d,0d)'::spoint @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,0d)'::spoint @ spoly '{(0d,0d),(0d,1d),(1d,1d),(...
                          ^
SELECT '(0.5d,0.5d)'::spoint @ spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0.5d,0.5d)'::spoint @ spoly '{(0d,0d),(0.5d,0.5d),(...
                              ^
SELECT '(0d,89.9d)'::spoint @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,89.9d)'::spoint @ spoly '{(0d,89d),(90d,89d),(18...
                             ^
SELECT '(0d,90d)'::spoint @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,90d)'::spoint @ spoly '{(0d,89d),(90d,89d),(180d...
                           ^
SELECT '(0d,-89.9d)'::spoint @ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,-89.9d)'::spoint @ spoly '{(0d,-89d),(90d,-89d),...
                              ^
SELECT '(0d,-90d)'::spoint @ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,-90d)'::spoint @ spoly '{(0d,-89d),(90d,-89d),(1...
                            ^
--- should be false
SELECT '(0.1d,0.5d)'::spoint @ spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0.1d,0.5d)'::spoint @ spoly '{(0d,0d),(0.5d,0.5d),(...
                              ^
SELECT '(45d,-89d)'::spoint @ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(45d,-89d)'::spoint @ spoly '{(0d,-89d),(90d,-89d),(...
                             ^
SELECT '(0d,1d)'::spoint @ spoly '{(0d,0d),(1d,1d),(1d,0d)}';
ERROR:  type "spoint" does not exist
LINE 1: SELECT '(0d,1d)'::spoint @ spoly '{(0d,0d),(1d,1d),(1d,0d)}'...
                          ^
--- spoly ~ spoint
--- should be true
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0.5d,0.5d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0.5d,0...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0d,0.5d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0d,0.5...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0d,0d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0d,0d)...
                ^
SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0.5d,0.5d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ '(0d,89.9d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ '(0d,90d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' ~ '(0d,-89.9d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' ~ '(0d,-90d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
--- should be false
SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}' ~ '(0.1d,0.5d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' ~ '(45d,-89d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,0d),(1d,1d),(1d,0d)}' ~ '(0d,1d)'::spoint;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(1d,1d),(1d,0d)}' ~ '(0d,1d)'::spoin...
                ^
--- scircle @ spoly
--- should be true
SELECT '<(0.5d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0.5d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0d,1...
                                     ^
SELECT '<(0d,89.9d),0.1d>'::scircle @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,89.9d),0.1d>'::scircle @ spoly '{(0d,89d),(90d,...
                                    ^
SELECT '<(0d,90d),0.1d>'::scircle @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,90d),0.1d>'::scircle @ spoly '{(0d,89d),(90d,89...
                                  ^
SELECT '<(0d,-89.9d),0.1d>'::scircle @ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,-89.9d),0.1d>'::scircle @ spoly '{(0d,-89d),(90...
                                     ^
SELECT '<(0d,-90d),0.1d>'::scircle @ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,-90d),0.1d>'::scircle @ spoly '{(0d,-89d),(90d,...
                                   ^
--- should be false
SELECT '<(0.1d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0.1d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0.5d...
                                     ^
SELECT '<(45d,-89d),0.1d>'::scircle @ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(45d,-89d),0.1d>'::scircle @ spoly '{(0d,-89d),(90d...
                                    ^
SELECT '<(0d,1d),0.1d>'::scircle @ spoly '{(0d,0d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,1d),0.1d>'::scircle @ spoly '{(0d,0d),(1d,1d),(...
                                 ^
SELECT '<(0d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0d,1d)...
                                   ^
SELECT '<(0d,0d),0.1d>'::scircle @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),0.1d>'::scircle @ spoly '{(0d,0d),(0d,1d),(...
                                 ^
SELECT '<(0.5d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0.5d,0.5d),0.1d>'::scircle @ spoly '{(0d,0d),(0.5d...
                                     ^
--- spoly ~ scircle
--- should be true
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.5d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.5d,...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ '<(0d,89.9d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ '<(0d,90d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' ~ '<(0d,-89.9d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' ~ '<(0d,-90d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
--- should be false
SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.1d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' ~ '<(45d,-89d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,0d),(1d,1d),(1d,0d)}' ~ '<(0d,1d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(1d,1d),(1d,0d)}' ~ '<(0d,1d),0.1d>'...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0d,0....
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0d,0d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0d,0d...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.1d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.1d,...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.1d,0.1d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.1d,...
                ^
SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}' ~ '<(0.6d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}...
                ^
--- spoly @ scircle
--- should be true
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ '<(0d,0d),2.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ '<(0d,0d)...
               ^
SELECT spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' @ '<(0d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' @ '<(0d,0...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' @ '<(0d,90d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' @ ...
               ^
SELECT spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' @ '<(180d,-90d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' @ '<(0d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' @ '<(0d,0d),1.0d>':...
               ^
--- should be false
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ '<(0d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ '<(0d,0d)...
               ^
SELECT spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' @ '<(0d,0d),0.99d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' @ '<(0d,0...
               ^
SELECT spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' @ '<(60d,0d),0.99d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' @ '<(60d,...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,88d)}' @ '<(0d,90d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,88d)}' @ ...
               ^
SELECT spoly '{(0d,-87d),(90d,-87d),(180d,-87d),(270d,-87d)}' @ '<(180d,-90d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,-87d),(90d,-87d),(180d,-87d),(270d,-87d)}...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(2d,0d)}' @ '<(0d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(2d,0d)}' @ '<(0d,0d),1.0d>':...
               ^
--- scircle ~ spoly
--- should be true
SELECT '<(0d,0d),2.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),2.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(...
                                 ^
SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(-1d,0d),(0d,1d),...
                                 ^
SELECT '<(0d,90d),1.0d>'::scircle ~ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,90d),1.0d>'::scircle ~ spoly '{(0d,89d),(90d,89...
                                  ^
SELECT '<(180d,-90d),1.0d>'::scircle ~ spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(180d,-90d),1.0d>'::scircle ~ spoly '{(0d,-89d),(90...
                                     ^
SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(...
                                 ^
--- should be false
SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(...
                                 ^
SELECT '<(0d,0d),0.99d>'::scircle ~ spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),0.99d>'::scircle ~ spoly '{(-1d,0d),(0d,1d)...
                                  ^
SELECT '<(60d,0d),0.99d>'::scircle ~ spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(60d,0d),0.99d>'::scircle ~ spoly '{(-1d,0d),(0d,1d...
                                   ^
SELECT '<(0d,90d),1.0d>'::scircle ~ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,88d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,90d),1.0d>'::scircle ~ spoly '{(0d,89d),(90d,89...
                                  ^
SELECT '<(180d,-90d),1.0d>'::scircle ~ spoly '{(0d,-87d),(90d,-87d),(180d,-87d),(270d,-87d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(180d,-90d),1.0d>'::scircle ~ spoly '{(0d,-87d),(90...
                                     ^
SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(2d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT '<(0d,0d),1.0d>'::scircle ~ spoly '{(0d,0d),(0d,1d),(...
                                 ^
--- scircle && spoly
--- should be true
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && '<(0.5d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && '<(0.5d...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && '<(0d,89.9d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && '<(0d,90d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' && '<(0d,-89.9d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' && '<(0d,-90d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && '<(0d,0d),2.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && '<(0d,0...
                ^
SELECT  spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' && '<(0d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}' && '<(0d...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && '<(0d,90d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' && '<(180d,-90d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
SELECT  spoly '{(0d,0d),(0d,1d),(1d,0d)}' && '<(0d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,0d)}' && '<(0d,0d),1.0d>...
                ^
SELECT  spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && '<(0d,2d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && '<(...
                ^
SELECT  spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && '<(2d,0d),1.0d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && '<(...
                ^
SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}' && '<(0.5d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}...
                ^
--- should be false
SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && '<(1.5d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && '<(1.5d...
                ^
SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && '<(0d,88.0d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &...
                ^
SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}' && '<(0.3d,0.5d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}...
                ^
SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}' && '<(0d,-87d),0.1d>'::scircle;
ERROR:  type "spoly" does not exist
LINE 1: SELECT  spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)...
                ^
--- spoly && scircle
--- should be true
SELECT  '<(0.5d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0.5d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0d...
                                      ^
SELECT  '<(0d,89.9d),0.1d>'::scircle && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,89.9d),0.1d>'::scircle && spoly '{(0d,89d),(90...
                                     ^
SELECT  '<(0d,90d),0.1d>'::scircle && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,90d),0.1d>'::scircle && spoly '{(0d,89d),(90d,...
                                   ^
SELECT  '<(0d,-89.9d),0.1d>'::scircle && spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,-89.9d),0.1d>'::scircle && spoly '{(0d,-89d),(...
                                      ^
SELECT  '<(0d,-90d),0.1d>'::scircle && spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,-90d),0.1d>'::scircle && spoly '{(0d,-89d),(90...
                                    ^
SELECT  '<(0d,0d),2.0d>'::scircle && spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,0d),2.0d>'::scircle && spoly '{(0d,0d),(0d,1d)...
                                  ^
SELECT  '<(0d,0d),1.0d>'::scircle && spoly '{(-1d,0d),(0d,1d),(1d,0d),(0d,-1d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,0d),1.0d>'::scircle && spoly '{(-1d,0d),(0d,1d...
                                  ^
SELECT  '<(0d,90d),1.0d>'::scircle && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,90d),1.0d>'::scircle && spoly '{(0d,89d),(90d,...
                                   ^
SELECT  '<(180d,-90d),1.0d>'::scircle && spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(180d,-90d),1.0d>'::scircle && spoly '{(0d,-89d),(...
                                      ^
SELECT  '<(0d,0d),1.0d>'::scircle && spoly '{(0d,0d),(0d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,0d),1.0d>'::scircle && spoly '{(0d,0d),(0d,1d)...
                                  ^
SELECT  '<(0d,2d),1.0d>'::scircle && spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,2d),1.0d>'::scircle && spoly '{(-1d,-1d),(-1d,...
                                  ^
SELECT  '<(2d,0d),1.0d>'::scircle && spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(2d,0d),1.0d>'::scircle && spoly '{(-1d,-1d),(-1d,...
                                  ^
SELECT  '<(0.5d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0.5d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0....
                                      ^
--- should be false
SELECT  '<(1.5d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(1.5d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0d...
                                      ^
SELECT  '<(0d,88.0d),0.1d>'::scircle && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,88.0d),0.1d>'::scircle && spoly '{(0d,89d),(90...
                                     ^
SELECT  '<(0.3d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0.5d,0.5d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0.3d,0.5d),0.1d>'::scircle && spoly '{(0d,0d),(0....
                                      ^
SELECT  '<(0d,-87d),0.1d>'::scircle && spoly '{(0d,-89d),(90d,-89d),(180d,-89d),(270d,-89d)}';
ERROR:  type "scircle" does not exist
LINE 1: SELECT  '<(0d,-87d),0.1d>'::scircle && spoly '{(0d,-89d),(90...
                                    ^
--- spoly @ spoly
--- should be true
SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' @ spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' @ s...
               ^
SELECT spoly '{(-0.5d,-0.5d),(-0.5d,0.5d),(0.5d,0.5d),(0.5d,-0.5d)}' @ spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-0.5d,-0.5d),(-0.5d,0.5d),(0.5d,0.5d),(0.5d,...
               ^
SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' @ spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' @ s...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' @ spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' @ spoly '{(-1d,-1d)...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' @ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' @ spoly '{(0d,0d),(...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' @ ...
               ^
SELECT spoly '{(45d,89.3d),(135d,89.3d),(225d,89.3d),(315d,89.3d)}' @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(45d,89.3d),(135d,89.3d),(225d,89.3d),(315d,8...
               ^
--- should be false
--SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
SELECT spoly '{(45d,89.2d),(135d,89.2d),(225d,89.2d),(315d,89.2d)}' @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(45d,89.2d),(135d,89.2d),(225d,89.2d),(315d,8...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ spoly '{(0.5d,0.5d),(0.5d,1.5d),(1.5d,1.5d),(1.5d,0.5d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' @ spoly '{(...
               ^
SELECT spoly '{(0d,88d),(90d,88d),(180d,88d),(270d,88d)}' @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,88d),(90d,88d),(180d,88d),(270d,88d)}' @ ...
               ^
SELECT spoly '{(0d,-88d),(90d,-88d),(180d,-88d),(270d,-88d)}' @ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,-88d),(90d,-88d),(180d,-88d),(270d,-88d)}...
               ^
--- spoly ~ spoly
--- should be true                                                                                       
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly '{(-0.5d,-0.5d),(-0.5d,0.5d),(0.5d,0.5d),(0.5d,-0.5d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly '{(0d,0d),(0d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' ~ spoly...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ spoly '{(0d,0d),(0d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' ~ spoly '{(...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ ...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ spoly '{(45d,89.3d),(135d,89.3d),(225d,89.3d),(315d,89.3d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ ...
               ^
--- should be false
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ spoly '{(45d,89.2d),(135d,89.2d),(225d,89.2d),(315d,89.2d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ ...
               ^
SELECT spoly '{(0.5d,0.5d),(0.5d,1.5d),(1.5d,1.5d),(1.5d,0.5d)}' ~ spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0.5d,0.5d),(0.5d,1.5d),(1.5d,1.5d),(1.5d,0.5...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ spoly '{(0d,88d),(90d,88d),(180d,88d),(270d,88d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ ...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ spoly '{(0d,-88d),(90d,-88d),(180d,-88d),(270d,-88d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' ~ ...
               ^
--- spoly && spoly
--- should be true                                                                                       
SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' && spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' && ...
               ^
SELECT spoly '{(-0.5d,-0.5d),(-0.5d,0.5d),(0.5d,0.5d),(0.5d,-0.5d)}' && spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-0.5d,-0.5d),(-0.5d,0.5d),(0.5d,0.5d),(0.5d,...
               ^
SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' && spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}' && ...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' && spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' && spoly '{(-1d,-1d...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' && spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,0d)}' && spoly '{(0d,0d),...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &&...
               ^
SELECT spoly '{(45d,89.3d),(135d,89.3d),(225d,89.3d),(315d,89.3d)}' && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(45d,89.3d),(135d,89.3d),(225d,89.3d),(315d,8...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(-0.5d,-0.5d),(-0.5d,0.5d),(0.5d,0.5d),(0.5d,-0.5d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(0d,0d),(0d,0.5d),(0.5d,0.5d),(0.5d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(0d,0d),(0d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && spoly '{(0d,0d),(0d,1d),(1d,0d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && spoly '{...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &&...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && spoly '{(45d,89.3d),(135d,89.3d),(225d,89.3d),(315d,89.3d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &&...
               ^
SELECT spoly '{(45d,89.2d),(135d,89.2d),(225d,89.2d),(315d,89.2d)}' && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(45d,89.2d),(135d,89.2d),(225d,89.2d),(315d,8...
               ^
SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && spoly '{(0.5d,0.5d),(0.5d,1.5d),(1.5d,1.5d),(1.5d,0.5d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,0d),(0d,1d),(1d,1d),(1d,0d)}' && spoly '{...
               ^
SELECT spoly '{(0d,88d),(90d,88d),(180d,88d),(270d,88d)}' && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,88d),(90d,88d),(180d,88d),(270d,88d)}' &&...
               ^
--- should be false
SELECT spoly '{(0d,-88d),(90d,-88d),(180d,-88d),(270d,-88d)}' && spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,-88d),(90d,-88d),(180d,-88d),(270d,-88d)}...
               ^
SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' && spoly '{(0d,-88d),(90d,-88d),(180d,-88d),(270d,-88d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(0d,89d),(90d,89d),(180d,89d),(270d,89d)}' &&...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(3d,-1d),(3d,1d),(5d,1d),(5d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(-1d,3d),(-1d,5d),(1d,5d),(1d,3d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spoly '{(179d,-1d),(179d,1d),(181d,1d),(181d,-1d)}';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(-1d,-1d),(-1d,1d),(1d,1d),(1d,-1d)}' && spol...
               ^
--
-- ellipse and polygon
--
  
-- negators , commutator @,&&
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  s...
               ^
SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'    @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'    @  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}'   @  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}'   @  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  s...
               ^
SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'   &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'   &&  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}'  &&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}'  &&  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   !@  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   !@  s...
               ^
SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'   !@  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'   !@  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}'  !@  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}'  !@  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'  !&&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'  !&&  s...
               ^
SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'  !&&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}'  !&&  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}' !&&  sellipse '<{10d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}' !&&  s...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spoly '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spoly '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   ~  spoly '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spoly '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spoly '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'   &&  spoly '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spoly '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spoly '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !~  spoly '{(2...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spoly '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spoly '{(280d, -9d),(280d,-12d),(279d, -8d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spoly '{(...
               ^
SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spoly '{(280d,-11d),(280d,-12d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{10d,5d},(280d,-20d),90d>'  !&&  spoly '{(...
               ^
-- ellipse is point
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  sellipse '<{0d,0d},(280d,-20d),90d>'; 
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'   @  sellipse '<{0d,0d},(280d,-20d),90d>'; 
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'   @  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  sellipse '<{0d,0d},(280d,-20d),90d>'; 
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  sellipse '<{0d,0d},(280d,-20d),90d>'; 
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  s...
               ^
SELECT sellipse '<{0d,0d},(280d,-20d),90d>'   @  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{0d,0d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{0d,0d},(280d,-20d),90d>'   @  spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{0d,0d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{0d,0d},(280d,-20d),90d>'  &&  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{0d,0d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
SELECT sellipse '<{0d,0d},(280d,-20d),90d>'  &&  spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'; 
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{0d,0d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
-- ellipse is circle
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  sellipse '<{5d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  s...
               ^
SELECT spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}'   @  sellipse '<{2d,2d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}'   @  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  sellipse '<{5d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  sellipse '<{5d,5d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  s...
               ^
SELECT sellipse '<{5d,5d},(280d,-20d),90d>'   @  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ;
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,5d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{2d,2d},(280d,-20d),90d>'   @  spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{2d,2d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{5d,5d},(280d,-20d),90d>'  &&  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ;
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,5d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
SELECT sellipse '<{5d,5d},(280d,-20d),90d>'  &&  spoly '{(280d,-11d),(280d,-18d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,5d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
-- ellipse is line
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  sellipse '<{5d,0d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  s...
               ^
SELECT spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}'   @  sellipse '<{2d,0d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}'   @  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  sellipse '<{5d,0d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  sellipse '<{5d,0d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  s...
               ^
SELECT sellipse '<{5d,0d},(280d,-20d),90d>'   @  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ;
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,0d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{2d,0d},(280d,-20d),90d>'   @  spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{2d,0d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{5d,0d},(280d,-20d),90d>'  &&  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ;
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,0d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
SELECT sellipse '<{5d,0d},(280d,-20d),90d>'  &&  spoly '{(280d,-11d),(280d,-18d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,0d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
-- ellipse is a real ellipse
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  sellipse '<{5d,2d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'    @  s...
               ^
SELECT spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}'   @  sellipse '<{2d,1d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}'   @  s...
               ^
SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  sellipse '<{5d,2d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}'   &&  s...
               ^
SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  sellipse '<{5d,2d},(280d,-20d),90d>';
ERROR:  type "spoly" does not exist
LINE 1: SELECT spoly '{(280d,-11d),(280d,-20d),(279d, -12d)}'  &&  s...
               ^
SELECT sellipse '<{5d,2d},(280d,-20d),90d>'   @  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ;
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,2d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{2d,1d},(280d,-20d),90d>'   @  spoly '{(280d,-10d),(290d,-30d),(270d, -30d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{2d,1d},(280d,-20d),90d>'   @  spoly '{(28...
               ^
SELECT sellipse '<{5d,2d},(280d,-20d),90d>'  &&  spoly '{(280d, -9d),(280d, -8d),(279d, -8d)}' ;
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,2d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
SELECT sellipse '<{5d,2d},(280d,-20d),90d>'  &&  spoly '{(280d,-11d),(280d,-18d),(279d, -12d)}';
ERROR:  type "sellipse" does not exist
LINE 1: SELECT sellipse '<{5d,2d},(280d,-20d),90d>'  &&  spoly '{(28...
               ^
-- create polygon as aggregate
SELECT spoly(data.p) FROM ( SELECT spoint '(0,1)' as p UNION ALL SELECT spoint '(1,1)' UNION ALL SELECT '(1,0)' ) AS data ;
ERROR:  type "spoint" does not exist
LINE 1: SELECT spoly(data.p) FROM ( SELECT spoint '(0,1)' as p UNION...
                                           ^
-- test stored data
SELECT count(id) FROM spheretmp5 WHERE id=2  AND area(p) BETWEEN 5.735555 AND 5.735556 ;
ERROR:  relation "spheretmp5" does not exist
LINE 1: SELECT count(id) FROM spheretmp5 WHERE id=2  AND area(p) BET...
                              ^
-- check to create this small polygon without errors
SELECT area( spoly '{
  (3.09472232280407 , 1.47261266025223),
  (3.0947320190777 , 1.47261266025223),
  (3.0947320190777 , 1.47262235652586),
  (3.09472232280407 , 1.47262235652586) }') >= 0 ;
ERROR:  type "spoly" does not exist
LINE 1: SELECT area( spoly '{
                     ^
SELECT npoints( spoly '{
  (1.51214841579108 , -2.90888208684947e-05),
  (1.5121581120647 , -2.90888208684947e-05),
  (1.5121581120647 , -1.93925472462553e-05),
  (1.51214841579108 , -1.93925472462553e-05)
}');
ERROR:  type "spoly" does not exist
LINE 1: SELECT npoints( spoly '{
                        ^
